app/Http/Controllers/AutovermietungController.php

select * from `auto` where `auto`.`id` = '2' limit 1
select * from `auto`
---
    public function create()
    {
        //
        $auto = Auto::findorfail($_GET['id']);
        return view('autovermietung.create')->with('auto', $auto);

select * from `auto` where `auto`.`id` = '2' limit 1
update `auto` set `rented` = 1, `auto`.`updated_at` = '2023-12-14 00:03:37' where `id` = 2
---
    public function update(Request $request, string $id)
    {
        //
        $auto = Auto::findorfail($id);
        $auto->rented = 1;
        $auto->save();

select * from `auto` where `auto`.`id` = '2' limit 1
update `auto` set `rented` = 0, `auto`.`updated_at` = '2023-12-14 00:07:02' where `id` = 2
---
    public function destroy(string $id)
    {
        //
        $auto = Auto::findorfail($id);
        $auto->rented = 0;
        $auto->save();