app/Http/Controllers/AutoController.php

    public function index()
    {
        //
        $viewData = [];
        $viewData['autos'] = Auto::all();
---
select * from `auto`

    public function store(Request $request)
    {
        //
        $data = $request;
        $auto = new Auto();
        $auto->brand = $data['brand'];
        $auto->ps = $data['ps'];
        $auto->type = $data['type'];
        $auto->color = $data['color'];
        $auto->numberSeats = $data['numberSeats'];
        $auto->pricePerDay = $data['pricePerDay'];
        $auto->save();
---
insert into `auto` (`brand`, `ps`, `type`, `color`, `numberSeats`, `pricePerDay`, `updated_at`, `created_at`) values ('Audi', '302', 'A4', 'Blau', '5', '75.6', '2023-12-13 23:50:32', '2023-12-13 23:50:32')

    public function edit(string $id)
    {
        //
        $viewData['auto'] = Auto::findorfail($id);
---
select * from `auto` where `auto`.`id` = '3' limit 1

    public function update(Request $request, string $id)
    {
        //
        $auto = Auto::findorfail($id);
---
select * from `auto` where `auto`.`id` = '3' limit 1

    public function destroy(string $id)
    {
        //
        $auto = Auto::findorfail($id);
        $auto->delete();
---
select * from `auto` where `auto`.`id` = '3' limit 1
delete from `auto` where `id` = 3